import datetime
import random
import re

# Завдання 1
# Створіть функцію get_days_from_today(date), яка розраховує кількість днів між
# заданою датою і поточною датою.
def get_days_from_today(date: str) -> int:
    """
    Розраховує кількість днів між заданою датою і поточною датою.
    Якщо задана дата пізніша за поточну, результат від'ємний.
    :param date: дата у форматі 'YYYY-MM-DD'
    :return: різниця у днях
    :raise: ValueError якщо формат дати некоректний
    """

    try:
        # Перетворюємо рядок у datetime
        given_date = datetime.datetime.strptime(date, '%Y-%m-%d').date()
        # Отримуємо поточну дату
        today = datetime.date.today()

        # Різниця між датами
        delta = today - given_date

        # Повертаємо різницю у днях
        return delta.days

    except ValueError:
        raise ValueError("Неправильний формат вхідних даних.")

# Завдання 2
# Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному білеті
# з числами, що випали випадковим чином і в певному діапазоні під час чергового тиражу.
# Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
#
# Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе
# генерувати набір унікальних випадкових чисел для таких лотерей. Вона буде повертати
# випадковий набір чисел у межах заданих параметрів, причому всі випадкові числа в наборі
# повинні бути унікальні.
def get_numbers_ticket(min: int, max: int, quantity: int) -> list[int]:
    """
    Функція повертає список випадково вибраних, унікальних, відсортованих чисел.
    Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список.

    :param min: мінімальне можливе число (>= 1)
    :param max: максимальне можливе число (<= 1000)
    :param quantity: кількість чисел для вибору
    :return: відсортований список унікальних чисел або пустий список,
             якщо параметри некоректні
    """

    # Перевірка обмежень
    # 1. min не може бути меншим за 1
    # 2. max не може бути більшим за 1000
    # 3. min не може бути більшим за max
    # 4. quantity має бути більшим за 1
    # 5. Щоб забезпечити унікальність quantity має бути меншим
    #    або дорівнювати кількості унікальних значень між min та max
    if (
            min < 1 or
            max > 1000 or
            min > max or
            quantity < 1 or
            quantity > (max - min + 1)
    ):
        return []

    # Генерація унікальних чисел
    numbers = random.sample(range(min, max + 1), quantity)

    # Сортування результату
    return sorted(numbers)

# Завдання 3
#
# У вашій компанії ведеться активна маркетингова кампанія за допомогою SMS-розсилок.
# Для цього ви збираєте телефонні номери клієнтів із бази даних, але часто стикаєтеся
# тим, що номери записані у різних форматах. Наприклад:
#
# "    +38(050)123-32-34"
# "     0503451234"
# "(050)8889900"
# "38050-111-22-22"
# "38050 111 22 11   "
#
# Ваш сервіс розсилок може ефективно відправляти повідомлення лише тоді, коли номери
# телефонів представлені у коректному форматі. Тому вам необхідна функція, яка
# автоматично нормалізує номери телефонів до потрібного формату, видаляючи всі зайві
# символи та додаючи міжнародний код країни, якщо потрібно.
#
# Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до
# стандартного формату, залишаючи тільки цифри та символ '+' на початку.
#
# Функція приймає один аргумент — рядок з телефонним номером у будь-якому форматі та
# перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. Якщо
# номер не містить міжнародного коду, функція автоматично додає код '+38' (для України).
# Це гарантує, що всі номери будуть придатними для відправлення SMS.
def normalize_phone(phone_number: str) -> str:
    """
    Нормалізує телефонний номер до стандартного формату.
    Залишає лише цифри та символ '+' на початку.
    Якщо міжнародний код відсутній — додає '+38'.

    :param phone_number: телефонний номер у довільному форматі
    :return: нормалізований номер телефону з кодом України(+38XXXXXXXXXX)
    """

    # Видаляємо всі символи, крім цифр і '+'
    phone_number = re.sub(r"[^\d+]", "", phone_number.strip())

    # Якщо номер починається з '+', вважаємо що код є
    if phone_number.startswith("+"):
        return phone_number

    # Якщо номер починається з '380', додаємо '+'
    if phone_number.startswith("38"):
        return f"+{phone_number}"

    # В іншому випадку додаємо повний код країни
    return f"+38{phone_number}"

# Завдання 4

# У межах вашої організації, ви відповідаєте за організацію привітань колег з днем народження.
# Щоб оптимізувати цей процес, вам потрібно створити функцію get_upcoming_birthdays, яка допоможе
# вам визначати, кого з колег потрібно привітати. Функція повинна повернути список всіх у кого день
# народження вперед на 7 днів включаючи поточний день.

# У вашому розпорядженні є список users, кожен елемент якого містить інформацію про ім'я користувача
# та його день народження. Оскільки дні народження колег можуть припадати на вихідні, ваша функція також
# повинна враховувати це та переносити дату привітання на наступний робочий день, якщо необхідно.
def get_upcoming_birthdays(users: list) -> list:
    """
        Повертає список користувачів, яких потрібно привітати
        протягом наступних 7 днів включно з поточним днем.
        Якщо день народження припадає на вихідний —
        дата привітання переноситься на понеділок.
    """

    result: list = []

    # поточна дата
    today = datetime.date.today()

    for user in users:
        # парсимо дату народження
        birthday = datetime.datetime.strptime(user["birthday"], "%Y.%m.%d").date()
        # замінюєм рік на поточний
        birthday = birthday.replace(year=today.year)

        # перевірка тільки на 7 днів вперед
        if 0 <= (birthday - today).days <= 7:

            # якщо день народження випадає на вихідний, робимо зсув на наступний понеділок
            birthday = birthday if birthday.weekday() < 5 else birthday + datetime.timedelta(days= 7 - birthday.weekday())

            # додаємо людину до листа з привітаннями
            result.append({"name": user["name"], 'congratulation_date': birthday.strftime("%Y.%m.%d")})
    return result
