import random

# Завдання 2
# Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному білеті
# з числами, що випали випадковим чином і в певному діапазоні під час чергового тиражу.
# Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
#
# Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе
# генерувати набір унікальних випадкових чисел для таких лотерей. Вона буде повертати
# випадковий набір чисел у межах заданих параметрів, причому всі випадкові числа в наборі
# повинні бути унікальні.
def get_numbers_ticket(min: int, max: int, quantity: int) -> list[int]:
    """
    Функція повертає список випадково вибраних, унікальних, відсортованих чисел.
    Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список.

    :param min: мінімальне можливе число (>= 1)
    :param max: максимальне можливе число (<= 1000)
    :param quantity: кількість чисел для вибору
    :return: відсортований список унікальних чисел або пустий список,
             якщо параметри некоректні
    """

    # Перевірка обмежень
    # 1. min не може бути меншим за 1
    # 2. max не може бути більшим за 1000
    # 3. min не може бути більшим за max
    # 4. quantity має бути більшим за 1
    # 5. Щоб забезпечити унікальність quantity має бути меншим
    #    або дорівнювати кількості унікальних значень між min та max
    if (
            min < 1 or
            max > 1000 or
            min > max or
            quantity < 1 or
            quantity > (max - min + 1)
    ):
        return []

    # Генерація унікальних чисел
    numbers = random.sample(range(min, max + 1), quantity)

    return sorted(numbers)