import re

# Завдання 3
#
# У вашій компанії ведеться активна маркетингова кампанія за допомогою SMS-розсилок.
# Для цього ви збираєте телефонні номери клієнтів із бази даних, але часто стикаєтеся
# тим, що номери записані у різних форматах. Наприклад:
#
# "    +38(050)123-32-34"
# "     0503451234"
# "(050)8889900"
# "38050-111-22-22"
# "38050 111 22 11   "
#
# Ваш сервіс розсилок може ефективно відправляти повідомлення лише тоді, коли номери
# телефонів представлені у коректному форматі. Тому вам необхідна функція, яка
# автоматично нормалізує номери телефонів до потрібного формату, видаляючи всі зайві
# символи та додаючи міжнародний код країни, якщо потрібно.
#
# Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до
# стандартного формату, залишаючи тільки цифри та символ '+' на початку.
#
# Функція приймає один аргумент — рядок з телефонним номером у будь-якому форматі та
# перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. Якщо
# номер не містить міжнародного коду, функція автоматично додає код '+38' (для України).
# Це гарантує, що всі номери будуть придатними для відправлення SMS.
def normalize_phone(phone_number: str) -> str:
    """
    Нормалізує телефонний номер до стандартного формату.
    Залишає лише цифри та символ '+' на початку.
    Якщо міжнародний код відсутній — додає '+38'.

    :param phone_number: телефонний номер у довільному форматі
    :return: нормалізований номер телефону з кодом України(+38XXXXXXXXXX)
    """

    # Залишаємо тільки цифри
    phone_number = re.sub(r"\D", "", phone_number)

    # Якщо номер уже з кодом України
    if phone_number.startswith("380"):
        return f"+{phone_number}"

    # В іншому випадку додаємо повний код країни
    return f"+38{phone_number}"