import datetime

# Завдання 4

# У межах вашої організації, ви відповідаєте за організацію привітань колег з днем народження.
# Щоб оптимізувати цей процес, вам потрібно створити функцію get_upcoming_birthdays, яка допоможе
# вам визначати, кого з колег потрібно привітати. Функція повинна повернути список всіх у кого день
# народження вперед на 7 днів включаючи поточний день.

# У вашому розпорядженні є список users, кожен елемент якого містить інформацію про ім'я користувача
# та його день народження. Оскільки дні народження колег можуть припадати на вихідні, ваша функція також
# повинна враховувати це та переносити дату привітання на наступний робочий день, якщо необхідно.
def get_upcoming_birthdays(users: list) -> list:
    """
        Повертає список користувачів, яких потрібно привітати
        протягом наступних 7 днів включно з поточним днем.
        Якщо день народження припадає на вихідний —
        дата привітання переноситься на понеділок.
    """

    result: list = []

    # поточна дата
    today = datetime.date.today()

    for user in users:
        # парсимо дату народження
        birthday = datetime.datetime.strptime(user["birthday"], "%Y.%m.%d").date()

        # замінюєм рік на поточний
        birthday = birthday.replace(year=today.year)

        # якщо день народження вже пройшов, то додаємо рік.
        # це потрібно для вирішення корнер кейсів коли сьогодні 30 грудня,
        # а у людини день народження в січні
        if birthday < today:
            birthday = birthday.replace(year=today.year + 1)

        # перевірка тільки на 7 днів вперед
        if 0 <= (birthday - today).days <= 7:

            # якщо день народження випадає на вихідний, робимо зсув на наступний понеділок
            birthday = birthday if birthday.weekday() < 5 else birthday + datetime.timedelta(days= 7 - birthday.weekday())

            # додаємо людину до листа з привітаннями
            result.append({"name": user["name"], 'congratulation_date': birthday.strftime("%Y.%m.%d")})
    return result